baseline/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 | 
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \\    /   O peration     | Version:  v2012                                 | 
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      | 
|    \\/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile                                                                        
{                                                                               
    version     2.0;                                                            
    format      ascii;                                                          
    class       dictionary;                                                     
    object      blockMeshDict;                                                  
}                                                                               
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

scale 1.000000; 

vertices 
( 
    (0.000000 0.000000 0.000000)
    (0.750000 0.000000 0.000000)
    (0.750000 0.050000 0.000000)
    (0.000000 0.070000 0.000000)
    (1.500000 0.000000 0.000000)
    (1.500000 0.070000 0.000000)
    (0.000000 0.000000 0.010000)
    (0.750000 0.000000 0.010000)
    (0.750000 0.050000 0.010000)
    (0.000000 0.070000 0.010000)
    (1.500000 0.000000 0.010000)
    (1.500000 0.070000 0.010000)
); 

blocks 
( 
    hex (0 1 2 3 6 7 8 9) (150 60 1) simpleGrading (0.500000 0.020000 1.000000)
    hex (1 4 5 2 7 10 11 8) (150 60 1) simpleGrading (2.000000 0.020000 1.000000)
); 

edges 
(
	polyLine 3 2 ((	0	0.07	0	)
(	0.01	0.069991228	0	)
(	0.02	0.069964929	0	)
(	0.03	0.069921147	0	)
(	0.04	0.06985996	0	)
(	0.05	0.069781476	0	)
(	0.06	0.069685832	0	)
(	0.07	0.069573195	0	)
(	0.08	0.069443764	0	)
(	0.09	0.069297765	0	)
(	0.1	0.069135455	0	)
(	0.11	0.068957118	0	)
(	0.12	0.068763067	0	)
(	0.13	0.068553643	0	)
(	0.14	0.068329212	0	)
(	0.15	0.06809017	0	)
(	0.16	0.067836935	0	)
(	0.17	0.067569951	0	)
(	0.18	0.067289686	0	)
(	0.19	0.066996633	0	)
(	0.2	0.066691306	0	)
(	0.21	0.06637424	0	)
(	0.22	0.066045991	0	)
(	0.23	0.065707136	0	)
(	0.24	0.065358268	0	)
(	0.25	0.065	0	)
(	0.26	0.06463296	0	)
(	0.27	0.064257793	0	)
(	0.28	0.063875156	0	)
(	0.29	0.06348572	0	)
(	0.3	0.06309017	0	)
(	0.31	0.062689198	0	)
(	0.32	0.062283509	0	)
(	0.33	0.061873813	0	)
(	0.34	0.06146083	0	)
(	0.35	0.061045285	0	)
(	0.36	0.060627905	0	)
(	0.37	0.060209424	0	)
(	0.38	0.059790576	0	)
(	0.39	0.059372095	0	)
(	0.4	0.058954715	0	)
(	0.41	0.05853917	0	)
(	0.42	0.058126187	0	)
(	0.43	0.057716491	0	)
(	0.44	0.057310802	0	)
(	0.45	0.05690983	0	)
(	0.46	0.05651428	0	)
(	0.47	0.056124844	0	)
(	0.48	0.055742207	0	)
(	0.49	0.05536704	0	)
(	0.5	0.055	0	)
(	0.51	0.054641732	0	)
(	0.52	0.054292864	0	)
(	0.53	0.053954009	0	)
(	0.54	0.05362576	0	)
(	0.55	0.053308694	0	)
(	0.56	0.053003367	0	)
(	0.57	0.052710314	0	)
(	0.58	0.052430049	0	)
(	0.59	0.052163065	0	)
(	0.6	0.05190983	0	)
(	0.61	0.051670788	0	)
(	0.62	0.051446357	0	)
(	0.63	0.051236933	0	)
(	0.64	0.051042882	0	)
(	0.65	0.050864545	0	)
(	0.66	0.050702235	0	)
(	0.67	0.050556236	0	)
(	0.68	0.050426805	0	)
(	0.69	0.050314168	0	)
(	0.7	0.050218524	0	)
(	0.71	0.05014004	0	)
(	0.72	0.050078853	0	)
(	0.73	0.050035071	0	)
(	0.74	0.050008772	0	)
(	0.75	0.05	0	))
	polyLine 9 8 ((	0	0.07	0.01	)
(	0.01	0.069991228	0.01	)
(	0.02	0.069964929	0.01	)
(	0.03	0.069921147	0.01	)
(	0.04	0.06985996	0.01	)
(	0.05	0.069781476	0.01	)
(	0.06	0.069685832	0.01	)
(	0.07	0.069573195	0.01	)
(	0.08	0.069443764	0.01	)
(	0.09	0.069297765	0.01	)
(	0.1	0.069135455	0.01	)
(	0.11	0.068957118	0.01	)
(	0.12	0.068763067	0.01	)
(	0.13	0.068553643	0.01	)
(	0.14	0.068329212	0.01	)
(	0.15	0.06809017	0.01	)
(	0.16	0.067836935	0.01	)
(	0.17	0.067569951	0.01	)
(	0.18	0.067289686	0.01	)
(	0.19	0.066996633	0.01	)
(	0.2	0.066691306	0.01	)
(	0.21	0.06637424	0.01	)
(	0.22	0.066045991	0.01	)
(	0.23	0.065707136	0.01	)
(	0.24	0.065358268	0.01	)
(	0.25	0.065	0.01	)
(	0.26	0.06463296	0.01	)
(	0.27	0.064257793	0.01	)
(	0.28	0.063875156	0.01	)
(	0.29	0.06348572	0.01	)
(	0.3	0.06309017	0.01	)
(	0.31	0.062689198	0.01	)
(	0.32	0.062283509	0.01	)
(	0.33	0.061873813	0.01	)
(	0.34	0.06146083	0.01	)
(	0.35	0.061045285	0.01	)
(	0.36	0.060627905	0.01	)
(	0.37	0.060209424	0.01	)
(	0.38	0.059790576	0.01	)
(	0.39	0.059372095	0.01	)
(	0.4	0.058954715	0.01	)
(	0.41	0.05853917	0.01	)
(	0.42	0.058126187	0.01	)
(	0.43	0.057716491	0.01	)
(	0.44	0.057310802	0.01	)
(	0.45	0.05690983	0.01	)
(	0.46	0.05651428	0.01	)
(	0.47	0.056124844	0.01	)
(	0.48	0.055742207	0.01	)
(	0.49	0.05536704	0.01	)
(	0.5	0.055	0.01	)
(	0.51	0.054641732	0.01	)
(	0.52	0.054292864	0.01	)
(	0.53	0.053954009	0.01	)
(	0.54	0.05362576	0.01	)
(	0.55	0.053308694	0.01	)
(	0.56	0.053003367	0.01	)
(	0.57	0.052710314	0.01	)
(	0.58	0.052430049	0.01	)
(	0.59	0.052163065	0.01	)
(	0.6	0.05190983	0.01	)
(	0.61	0.051670788	0.01	)
(	0.62	0.051446357	0.01	)
(	0.63	0.051236933	0.01	)
(	0.64	0.051042882	0.01	)
(	0.65	0.050864545	0.01	)
(	0.66	0.050702235	0.01	)
(	0.67	0.050556236	0.01	)
(	0.68	0.050426805	0.01	)
(	0.69	0.050314168	0.01	)
(	0.7	0.050218524	0.01	)
(	0.71	0.05014004	0.01	)
(	0.72	0.050078853	0.01	)
(	0.73	0.050035071	0.01	)
(	0.74	0.050008772	0.01	)
(	0.75	0.05	0.01	))
	polyLine 2 5 ((	0.75	0.05	0	)
(	0.76	0.050008772	0	)
(	0.77	0.050035071	0	)
(	0.78	0.050078853	0	)
(	0.79	0.05014004	0	)
(	0.8	0.050218524	0	)
(	0.81	0.050314168	0	)
(	0.82	0.050426805	0	)
(	0.83	0.050556236	0	)
(	0.84	0.050702235	0	)
(	0.85	0.050864545	0	)
(	0.86	0.051042882	0	)
(	0.87	0.051236933	0	)
(	0.88	0.051446357	0	)
(	0.89	0.051670788	0	)
(	0.9	0.05190983	0	)
(	0.91	0.052163065	0	)
(	0.92	0.052430049	0	)
(	0.93	0.052710314	0	)
(	0.94	0.053003367	0	)
(	0.95	0.053308694	0	)
(	0.96	0.05362576	0	)
(	0.97	0.053954009	0	)
(	0.98	0.054292864	0	)
(	0.99	0.054641732	0	)
(	1	0.055	0	)
(	1.01	0.05536704	0	)
(	1.02	0.055742207	0	)
(	1.03	0.056124844	0	)
(	1.04	0.05651428	0	)
(	1.05	0.05690983	0	)
(	1.06	0.057310802	0	)
(	1.07	0.057716491	0	)
(	1.08	0.058126187	0	)
(	1.09	0.05853917	0	)
(	1.1	0.058954715	0	)
(	1.11	0.059372095	0	)
(	1.12	0.059790576	0	)
(	1.13	0.060209424	0	)
(	1.14	0.060627905	0	)
(	1.15	0.061045285	0	)
(	1.16	0.06146083	0	)
(	1.17	0.061873813	0	)
(	1.18	0.062283509	0	)
(	1.19	0.062689198	0	)
(	1.2	0.06309017	0	)
(	1.21	0.06348572	0	)
(	1.22	0.063875156	0	)
(	1.23	0.064257793	0	)
(	1.24	0.06463296	0	)
(	1.25	0.065	0	)
(	1.26	0.065358268	0	)
(	1.27	0.065707136	0	)
(	1.28	0.066045991	0	)
(	1.29	0.06637424	0	)
(	1.3	0.066691306	0	)
(	1.31	0.066996633	0	)
(	1.32	0.067289686	0	)
(	1.33	0.067569951	0	)
(	1.34	0.067836935	0	)
(	1.35	0.06809017	0	)
(	1.36	0.068329212	0	)
(	1.37	0.068553643	0	)
(	1.38	0.068763067	0	)
(	1.39	0.068957118	0	)
(	1.4	0.069135455	0	)
(	1.41	0.069297765	0	)
(	1.42	0.069443764	0	)
(	1.43	0.069573195	0	)
(	1.44	0.069685832	0	)
(	1.45	0.069781476	0	)
(	1.46	0.06985996	0	)
(	1.47	0.069921147	0	)
(	1.48	0.069964929	0	)
(	1.49	0.069991228	0	)
(	1.5	0.07	0	))
	polyLine 8 11 ((	0.75	0.05	0.01	)
(	0.76	0.050008772	0.01	)
(	0.77	0.050035071	0.01	)
(	0.78	0.050078853	0.01	)
(	0.79	0.05014004	0.01	)
(	0.8	0.050218524	0.01	)
(	0.81	0.050314168	0.01	)
(	0.82	0.050426805	0.01	)
(	0.83	0.050556236	0.01	)
(	0.84	0.050702235	0.01	)
(	0.85	0.050864545	0.01	)
(	0.86	0.051042882	0.01	)
(	0.87	0.051236933	0.01	)
(	0.88	0.051446357	0.01	)
(	0.89	0.051670788	0.01	)
(	0.9	0.05190983	0.01	)
(	0.91	0.052163065	0.01	)
(	0.92	0.052430049	0.01	)
(	0.93	0.052710314	0.01	)
(	0.94	0.053003367	0.01	)
(	0.95	0.053308694	0.01	)
(	0.96	0.05362576	0.01	)
(	0.97	0.053954009	0.01	)
(	0.98	0.054292864	0.01	)
(	0.99	0.054641732	0.01	)
(	1	0.055	0.01	)
(	1.01	0.05536704	0.01	)
(	1.02	0.055742207	0.01	)
(	1.03	0.056124844	0.01	)
(	1.04	0.05651428	0.01	)
(	1.05	0.05690983	0.01	)
(	1.06	0.057310802	0.01	)
(	1.07	0.057716491	0.01	)
(	1.08	0.058126187	0.01	)
(	1.09	0.05853917	0.01	)
(	1.1	0.058954715	0.01	)
(	1.11	0.059372095	0.01	)
(	1.12	0.059790576	0.01	)
(	1.13	0.060209424	0.01	)
(	1.14	0.060627905	0.01	)
(	1.15	0.061045285	0.01	)
(	1.16	0.06146083	0.01	)
(	1.17	0.061873813	0.01	)
(	1.18	0.062283509	0.01	)
(	1.19	0.062689198	0.01	)
(	1.2	0.06309017	0.01	)
(	1.21	0.06348572	0.01	)
(	1.22	0.063875156	0.01	)
(	1.23	0.064257793	0.01	)
(	1.24	0.06463296	0.01	)
(	1.25	0.065	0.01	)
(	1.26	0.065358268	0.01	)
(	1.27	0.065707136	0.01	)
(	1.28	0.066045991	0.01	)
(	1.29	0.06637424	0.01	)
(	1.3	0.066691306	0.01	)
(	1.31	0.066996633	0.01	)
(	1.32	0.067289686	0.01	)
(	1.33	0.067569951	0.01	)
(	1.34	0.067836935	0.01	)
(	1.35	0.06809017	0.01	)
(	1.36	0.068329212	0.01	)
(	1.37	0.068553643	0.01	)
(	1.38	0.068763067	0.01	)
(	1.39	0.068957118	0.01	)
(	1.4	0.069135455	0.01	)
(	1.41	0.069297765	0.01	)
(	1.42	0.069443764	0.01	)
(	1.43	0.069573195	0.01	)
(	1.44	0.069685832	0.01	)
(	1.45	0.069781476	0.01	)
(	1.46	0.06985996	0.01	)
(	1.47	0.069921147	0.01	)
(	1.48	0.069964929	0.01	)
(	1.49	0.069991228	0.01	)
(	1.5	0.07	0.01	))
); 

boundary 
( 
    inlet 
    { 
        type patch; 
        faces 
        ( 
            (0 6 9 3) 
        ); 
    } 

    outlet 
    { 
        type patch; 
        faces 
        ( 
            (4 5 11 10) 
        ); 
    } 

    outerwall 
    { 
        type wall; 
        faces 
        ( 
            (3 9 8 2) 
            (2 8 11 5) 
        ); 
    } 

    longitudinal_symmetry 
    { 
        type symmetryPlane; 
        faces 
        ( 
            (0 1 7 6) 
            (1 4 10 7) 
        ); 
    } 
    lateral_sides 
    { 
        type empty; 
        faces 
        ( 
            (0 3 2 1) 
            (1 2 5 4) 
            (6 7 8 9) 
            (7 10 11 8) 
        ); 
    } 
); 
 
mergePatchPairs 
( 
); 
 
// ************************************************************************* // 
