baseline/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          60;
        startFace       35640;
    }
    outlet
    {
        type            patch;
        nFaces          60;
        startFace       35700;
    }
    outerwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       35760;
    }
    longitudinal_symmetry
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          300;
        startFace       36060;
    }
    lateral_sides
    {
        type            empty;
        inGroups        1(empty);
        nFaces          36000;
        startFace       36360;
    }
)

// ************************************************************************* //
