baseline/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues ( volVectorFieldValue U ( 190 0 0 ) volScalarFieldValue T 270 volScalarFieldValue p 600 );

regions         ( boxToCell { box ( 0.75 -1 -1 ) ( 1.51 1 1 ) ; fieldValues ( volScalarFieldValue T 270 volScalarFieldValue p 300 ) ; } );

// ************************************************************************* //
