baseline/system/setFieldsDict_isentr
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues ( volVectorFieldValue U ( 125 0 0 ) volScalarFieldValue T 270 volScalarFieldValue p 600 );

regions         ( boxToCell { box ( 111 -10 -10 ) ( 151 10 10 ) ; fieldValues ( volScalarFieldValue T 270 volScalarFieldValue p 120 ) ; } );


// ************************************************************************* //
